app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2016-08-19 02:33:25.120566"], ["updated_at", "2016-08-19 02:33:25.120566"]]
---
  def create
    @school_class = SchoolClass.create(post_params)

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2016-08-19 12:17:09.167301"], ["id", 1]]
---
  def update
    @school_class.update(post_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", nil]]
---
  def find_school_class
    @school_class = SchoolClass.find(params[:id])