app/controllers/students_controller.rb

  def create
    student = Student.create(post_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-08-19 02:26:41.695832"], ["updated_at", "2016-08-19 02:26:41.695832"]]

  def update
    @student.update(post_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-08-19 12:26:29.003777"], ["id", 1]]